src/cfe/КСП/DataProcessors/КСП_Логгер_Аппендер_СпрЛогСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>КСП_Логгер_Аппендер_СпрЛогСообщений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_ЛогСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_ЛогСообщений</Name>
			<Comment>Сюда пишутся детальные сообщения лога</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетальноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ИндексЛога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/DataProcessors/КСП_Логгер_Аппендер_СпрЛогСообщений/Ext/ObjectModule.bsl
Перем ИдВызова Экспорт;

// Возвращает этот объект, если запись в приемник возможна. Иначе - возвращает Неопределено.
Функция Конструктор(ИдВызова_, Знач ИмяЛога = Неопределено) Экспорт
	Если Метаданные.Справочники.Найти("КСП_ЛогСообщений") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ИдВызова = ИдВызова_;
	Возврат ЭтотОбъект;
КонецФункции

//Параметры:
//	КраткоеОписание  	- Строка - Заголовок сообщения
//	ВидСообщения 		- ПеречислениеСсылка.КСП_СтатусыСообщений - Статус сообщения. Если строка, то это шаблон поиска в типовых сообщениях по шаблону
//							СправочникСсылка.ТиповыеСообщения, 
//							Строка 
//	ДетальноеОписание 	- Строка - Подробное сообщение
//	Уровень - число - уровень логов. 1-дебаг,2-инфо,3-варн,4-ерр,5-крит,9-офф
//Возвращаемое значение:
//	Нет
Процедура ЗаписатьСообщение(Знач КраткоеОписание = "ИНФО", 
						ВидСообщения = Неопределено, 
						Знач ДетальноеОписание="",
						Знач Уровень = 2) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Спр 					= Справочники.КСП_ЛогСообщений.СоздатьЭлемент();
	Спр.Наименование		= КраткоеОписание;
	Спр._Владелец			= ИдВызова;
	Спр.ВидСообщения 		= ВидСообщения;
	Спр.ДетальноеОписание	= ДетальноеОписание;
	Спр.ДатаВремя			= ТекущаяДатаСеанса(); 
	Попытка 
		Спр.Записать(); 
	Исключение
		ЗаписьЖурналаРегистрации(КраткоеОписание, 
			КСП_ЛоггерСервер.ВидСообщенияЖР(ВидСообщения), , , ДетальноеОписание,);
	КонецПопытки; 
		
КонецПроцедуры
